20220523173149-build_a_collective_brain.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-03 Wed 22:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Build a collective brain</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Build a collective brain</h1>
<p>
Collaborating on knowledge is hard. Organizations that are supposed to provide a setting for collective thinking, like think tanks, often fall short. Informations are hard to find, it is often hard to see where the original information comes from etc.
</p>

<p>
Complex thoughts are also very intricated. It is very hard, for instance, to write a report on climate change mitigation without invoking industrial and energy production strategy, which are topics in their own right. In reality, <i>topics overlap because they are the combination of atomic thoughts</i>.
</p>

<p>
<b>Insert example of such atomic thoughts</b>
</p>

<ul class="org-ul">
<li>Nuclear energy is low-carbon</li>
<li>Nuclear energy is safe</li>
<li>France imports its Uranium</li>
</ul>

<p>
Here are the constraints we are taking into account:
</p>
<ul class="org-ul">
<li>Participants have little time to contribute;</li>
<li>Invited collaborators have even less time to contribute;</li>
<li>Most readers are often interested in a few point;</li>
<li>Read want to source intforma</li>
</ul>

<div id="outline-container-org1257995" class="outline-2">
<h2 id="org1257995"><span class="todo TODO">TODO</span> How is it linked to wiki?</h2>
</div>

<div id="outline-container-org2c701a4" class="outline-2">
<h2 id="org2c701a4">Atomic notes</h2>
<div class="outline-text-2" id="text-org2c701a4">
<p>
Notes have one simple conclusion that can be referenced in other notes. They are <b>units of knowledge</b> and are written so they can stay <i>evergreen</i>. Examples are:
</p>

<ul class="org-ul">
<li>"Nuclear energy is a low-carbon energy"</li>
<li>"Nuclear energy is safe"</li>
</ul>

<p>
And notes contain supporting evidence, graphs etc.
</p>

<p>
Working with atomic, evergreen notes has several purposes:
</p>
<ul class="org-ul">
<li>We can easily collaborate without impeding on each other's work;</li>
<li>We can ask for help on <i>very specific</i> topics (instead of collaborations on a whole report, which can take a lot of time);</li>
<li>We can contribute even when we have very little time;</li>
<li>Work can easily be interrupted</li>
<li>Old reports still refer to up-to-date evidence.</li>
</ul>

<p>
<b>Notes are an interface to an idea</b>.The concept is the interface, and everything that supports this concept is hidden in the note. This means we can use notes as legos; details do not matter. Similarly to computer programming the art of writing notes is thus the art of finding the correct interafce, the right level of granularity. Once we have the right interface we can call them in support of other concepts.
</p>

<p>
<b>Knowledge accumulates</b>. Writing reports and refering to them is a messy process. Here we are sure that knowledge accumulates over time, which is not guaranteed by any other system.
</p>
</div>
</div>

<div id="outline-container-org6640930" class="outline-2">
<h2 id="org6640930">Links are updated and reflect dependence</h2>
<div class="outline-text-2" id="text-org6640930">
<p>
Notes can make use of the conclusion of other notes to output a new conclusion.
</p>

<p>
<b>Graph is the current state of knowledge: concepts and how they are connected.</b> It is frequent to "discover" relations between concepts and adding them while exploring the graph.
</p>

<p>
Notes should be densely connected.
</p>

<p>
If notes are well-connected it is much easier to propagate corrections from an existing notes. When I modify the note "France imports most of its Uranium" because of a change in policy, I am able to see the notes that were referencing this conclusion, and potentially change their conclusion, and propagate this change, etc. Changes are propagated recursively until no correction is needed anymore. If the links are up-to-date this process ensures that everything that needs updating is updated.
</p>

<p>
If only the evidence to a note is changed, but the conclusion is not changed then no other note is affected!
</p>

<p>
<i>Good structure allows to propagate conclusions.</i>
</p>
</div>
</div>

<div id="outline-container-orgd8f4bde" class="outline-2">
<h2 id="orgd8f4bde">Reports are timestamped snapshots</h2>
<div class="outline-text-2" id="text-orgd8f4bde">
<p>
They are perishable: they may be missing concepts or the way they organize concepts may not be optimal. But since notes reference concept notes, readers can at all time check the supporting evidence.
</p>

<p>
But because reports are still available, if concepts become void we need to keep the note, indicate it is and explain why. We then propagate changes through the graph.
</p>
</div>
</div>

<div id="outline-container-orga3d3ebd" class="outline-2">
<h2 id="orga3d3ebd">Technical solution</h2>
<div class="outline-text-2" id="text-orga3d3ebd">
<p>
<b>Vizualising notes is paramount</b>
</p>
<ul class="org-ul">
<li>It is interesting to have a full list of a note's parents at the bottom of a note;</li>
<li>But also see the notes that are 2-3 steps away from the note represented as a graph. This is how most connections are made.</li>
<li><p>
And finally there should be a view of the full graph somewhere
</p>

<p>
<a href="20211125113956-my_digital_garden.html#ID-7dae4406-eb94-4496-93e1-a989cab14729">Navigate linked notes</a>
</p></li>
</ul>

<p>
<b>We can measure graph properties</b>
</p>
</div>

<div id="outline-container-org74d7341" class="outline-3">
<h3 id="org74d7341">Logseq</h3>
<div class="outline-text-3" id="text-org74d7341">
<p>
How can we collaborate on logseq
</p>
</div>
</div>
<div id="outline-container-orgdb3b6ba" class="outline-3">
<h3 id="orgdb3b6ba">Regular export to a static website</h3>
</div>
<div id="outline-container-orge33f83e" class="outline-3">
<h3 id="orge33f83e">Org-roam</h3>
</div>
</div>

<div id="outline-container-orgacbe7cd" class="outline-2">
<h2 id="orgacbe7cd">Links to this note</h2>
</div>
</div>
</body>
</html>
